---
kind: type
id: T:Autodesk.Revit.DB.Structure.StickElementProjectionZ
source: html/174346c5-e7f3-58f1-1495-3836c9f973e3.htm
---
# Autodesk.Revit.DB.Structure.StickElementProjectionZ

Presets for given Analytical Projection.

## Syntax (C#)
```csharp
[ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum StickElementProjectionZ
```